<?php

namespace App\Jobs;

use App\Article;
use Illuminate\Bus\Queueable;
use Illuminate\Contracts\Queue\ShouldQueue;
use Illuminate\Foundation\Bus\Dispatchable;
use Illuminate\Queue\InteractsWithQueue;
use Illuminate\Queue\SerializesModels;

class RandInsert implements ShouldQueue
{
    use Dispatchable, InteractsWithQueue, Queueable, SerializesModels;

    protected $origin = ['这', '几', '天', '心', '里', '颇', '不', '宁', '静', '。', '今', '晚', '在', '院', '子', '坐', '着', '乘', '凉', '，', '忽', '然', '想', '起', '日', '走', '过', '的', '荷', '塘', '满', '月', '光', '总', '该', '另', '有', '一', '番', '样', '吧', '亮', '渐', '地', '升', '高', '了', '墙', '外', '马', '路', '上', '孩', '们', '欢', '笑', '已', '经', '听', '见', '；', '妻', '屋', '拍', '闰', '儿', '⑴', '迷', '糊', '哼', '眠', '歌', '我', '悄', '披', '大', '衫', '带', '门', '出', '去', '沿', '是', '条', '曲', '折', '小', '煤', '屑', '幽', '僻', '白', '也', '少', '人', '夜', '更', '加', '寂', '寞', '四', '面', '长', '许', '多', '树', '蓊', '郁', '⑵', '旁', '些', '杨', '柳', '和', '知', '道', '名', '字', '没', '阴', '森', '怕', '却', '很', '好', '虽', '还', '淡', '只', '个', '背', '手', '踱', '⑶', '片', '像', '超', '平', '常', '自', '己', '到', '世', '界', '爱', '热', '闹', '冷', '群', '居', '独', '处', '苍', '茫', '下', '什', '么', '都', '可', '以', '便', '觉', '由', '定', '要', '做', '事', '说', '话', '现', ' ', '理', '妙', '且', '受', '用', '无', '边', '香', '色', '弥', '望', '⑷', '田', '⑸', '叶', '水', '亭', '舞', '女', '裙', '层', '中', '间', '零', '星', '点', '缀', '花', '袅', '娜', '⑹', '开', '羞', '涩', '打', '朵', '正', '如', '粒', '明', '珠', '又', '碧', '刚', '浴', '美', '微', '风', '送', '来', '缕', '清', '仿', '佛', '远', '楼', '渺', '声', '似', '时', '候', '与', '丝', '颤', '动', '闪', '电', '般', '霎', '传', '那', '本', '肩', '并', '密', '挨', '宛', '凝', '波', '痕', '底', '脉', '⑺', '流', '遮', '住', '能', '颜', '而', '致', '⑻', '泻', '薄', '青', '雾', '浮', '牛', '乳', '洗', '笼', '轻', '纱', '梦', '云', '所', '朗', '照', '但', '为', '恰', '—', '酣', '固', '睡', '别', '味', '隔', '丛', '生', '灌', '木', '落', '参', '差', '斑', '驳', '黑', '影', '峭', '楞', '鬼', '弯', '稀', '疏', '倩', '画', '均', '匀', '谐', '旋', '律', '梵', '婀', '玲', '⑼', '奏', '近', '低', '最', '将', '重', '围', '漏', '段', '空', '隙', '特', '留', '例', '乍', '看', '团', '烟', '丰', '姿', '⑽', '辨', '得', '梢', '隐', '约', '山', '意', '罢', '缝', '两', '灯', '精', '采', '渴', '⑾', '眼', '数', '蝉', '蛙', '它', '莲', '情', '江', '南', '旧', '俗', '乎', '早', '就', '六', '朝', '盛', '从', '诗', '略', '年', '她', '荡', '船', '唱', '艳', '季', '节', '梁', '元', '帝', '《', '赋', '》', '：', '于', '妖', '童', '媛', '⑿', '舟', '鷁', '首', '⒀', '徐', '回', '兼', '羽', '杯', '⒁', '棹', '⒂', '移', '藻', '挂', '欲', '萍', '尔', '其', '纤', '腰', '束', '素', '⒃', '迁', '延', '顾', '步', '夏', '始', '春', '余', '嫩', '初', '恐', '沾', '裳', '浅', '畏', '倾', '敛', '裾', '⒅', '当', '嬉', '游', '景', '真', '趣', '惜', '福', '消', '记', '西', '洲', '句', '秋', '头', '弄', '若', '算', '“', '”', '行', '令', '惦', '猛', '抬', '前', '推', '进', '息', '熟', '久', '九', '二', '七', '北', '京', '华', '园',
    ];

    /**
     * Create a new job instance.
     *
     * @return void
     */
    public function __construct()
    {
        //
    }

    /**
     * Execute the job.
     *
     * @return void
     */
    public function handle()
    {
        //
        for ($i = 0; $i < 1000; $i++) {
            $this->insert();
        }

    }

    private function insert()
    {
        $titleLength = mt_rand(10, 20);
        $contentLength = mt_rand(50, 300);
        $title = '';
        $content = '';
        for ($i = 0; $i < $titleLength; $i++) {
            $title .= $this->origin[mt_rand(0, count($this->origin))] ?? '';
        }
        for ($i = 0; $i < $contentLength; $i++) {
            $content .= $this->origin[mt_rand(0, count($this->origin))] ?? '';
        }

        Article::create([
            'title' => $title,
            'content' => $content,
        ]);
    }
}
